ggb123-seven/esp_brookesia_phone/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_ENABLE_SD_CARD=y
CONFIG_EXAMPLE_ENABLE_APP_CALCULATOR=n
CONFIG_EXAMPLE_ENABLE_APP_GAME_2048=n
CONFIG_EXAMPLE_ENABLE_APP_MUSIC_PLAYER=n
CONFIG_EXAMPLE_ENABLE_APP_VIDEO_PLAYER=n
CONFIG_EXAMPLE_ENABLE_APP_ENVIRONMENT_MONITOR=y
CONFIG_EXAMPLE_ENABLE_APP_CLASSROOM_SCHEDULE=y
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_SERVER_HOST="10.34.88.246"
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_SERVER_PORT=8080
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_API_PATH="/classroom-schedule/today"
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_BUILDINGS_PATH="/classroom-schedule/buildings"
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_ROOMS_PATH="/classroom-schedule/rooms"
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_TOKEN="change-me"
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_REFRESH_MS=600000
CONFIG_EXAMPLE_CLASSROOM_SCHEDULE_REQUEST_TIMEOUT_MS=30000
CONFIG_EXAMPLE_ENABLE_PARENT_CALL_ALERT_SERVICE=y
CONFIG_EXAMPLE_PARENT_CALL_ALERT_SERVER_HOST="10.34.88.246"
CONFIG_EXAMPLE_PARENT_CALL_ALERT_SERVER_PORT=8080
CONFIG_EXAMPLE_PARENT_CALL_ALERT_API_PATH="/parent-call-alert/trigger"
CONFIG_EXAMPLE_PARENT_CALL_ALERT_TOKEN="change-me"
CONFIG_EXAMPLE_PARENT_CALL_ALERT_TRANSPORT_MOCK=y
CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_PHONE_NUMBER=""
CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_UART_NUM=2
CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_TX_GPIO=34
CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_RX_GPIO=35
CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_BAUD_RATE=115200
CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_COMMAND_TIMEOUT_MS=8000
CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_CALL_HOLD_MS=15000
# CONFIG_EXAMPLE_PARENT_CALL_ALERT_AIR780E_SELF_TEST_ON_BOOT is not set
CONFIG_EXAMPLE_PARENT_CALL_ALERT_COOLDOWN_MS=300000
CONFIG_EXAMPLE_PARENT_CALL_ALERT_REQUEST_TIMEOUT_MS=8000
CONFIG_EXAMPLE_PARENT_CALL_ALERT_TASK_STACK_SIZE=6144
CONFIG_EXAMPLE_PARENT_CALL_ALERT_TASK_PRIORITY=5
CONFIG_EXAMPLE_PARENT_CALL_ALERT_QUEUE_LENGTH=4
CONFIG_EXAMPLE_ENABLE_DHT11_SERVICE=y
CONFIG_EXAMPLE_DHT11_DATA_GPIO=32
CONFIG_EXAMPLE_DHT11_SAMPLE_PERIOD_MS=2000
CONFIG_EXAMPLE_DHT11_MAX_CONSECUTIVE_FAILURES=3
CONFIG_EXAMPLE_DHT11_TASK_STACK_SIZE=3072
CONFIG_EXAMPLE_DHT11_TASK_PRIORITY=4
CONFIG_EXAMPLE_ENABLE_MQ2_SERVICE=y
CONFIG_EXAMPLE_MQ2_DO_GPIO=33
CONFIG_EXAMPLE_MQ2_ALARM_LEVEL=0
CONFIG_EXAMPLE_MQ2_SAMPLE_PERIOD_MS=500
CONFIG_EXAMPLE_MQ2_WARMUP_MS=30000
CONFIG_EXAMPLE_MQ2_CONFIRM_SAMPLES=3
CONFIG_EXAMPLE_MQ2_TASK_STACK_SIZE=3072
CONFIG_EXAMPLE_MQ2_TASK_PRIORITY=4
CONFIG_EXAMPLE_ENABLE_CAM_SENSOR_PIC_VFLIP=n
CONFIG_EXAMPLE_ENABLE_CAM_SENSOR_PIC_HFLIP=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=20
CONFIG_ESP_HOSTED_PRIV_WIFI_TX_SDIO_HIGH_THRESHOLD=80
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=n
CONFIG_VFS_MAX_COUNT=15
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=n
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ESP_BROOKESIA_LOG_STYLE_STD=y
CONFIG_ESP_BROOKESIA_MEMORY_USE_CUSTOM=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_CAMERA_SC2336=y
CONFIG_CAMERA_SC2336_MIPI_RAW10_1280X720_30FPS=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_CUSTOM_INCLUDE="esp_heap_caps.h"
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=15
CONFIG_LV_CIRCLE_CACHE_SIZE=10
CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=102400
CONFIG_LV_IMG_CACHE_DEF_SIZE=20
CONFIG_LV_GRAD_CACHE_DEF_SIZE=10240
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_SIMSUN_16_CJK=y
CONFIG_LV_USE_MONKEY=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
